import { H1, P, Section, SectionFlexible } from "@/components/ui/text";
import Image from "next/image";

export default function Page() {
    const CustomSection = ({ title, paragraph, src }: { title: string; src: string; paragraph: string }) => (
        <section className=" bg-slate-100 my-4 rounded-md">
            <div className="grid grid-cols-5 w-full h-full">
                <div className="col-span-1 flex w-full h-full bg-slate-200 p-2">
                    <div className="h-full w-full">
                        <Image height={128} width={256} alt="Not found!" src={src} />
                    </div>
                </div>
                <div className="col-span-4 p-2 flex flex-col gap-2">
                    <H1>{title}</H1>
                    <P>{paragraph}</P>
                </div>
            </div>
        </section>
    );

    return (
        <>
            <Section>
                <H1>Технологи</H1>
                <P>FUJI Precision нь үйлчлүүлэгчдэдээ аюулгүй, найдвартай, тав тухтай туршлагыг олгодог.</P>
            </Section>
            <CustomSection
                src="/r1.jpg"
                title="Хяналтын шүүгээ"
                paragraph={`
    1.	Нээх ажиллагаа шаардлагагүй, талбай дээр тохиргоо хийх шаардлагагүй, эрчим хүч аажмаар ажиллаж, суралцсаны дараа энгийнээр ажиллах боломжтой;
	2.	Зайны хяналтын зарчимд суурилсан шууд холболтын технологи нь хурдны муруйг бодит цаг хугацаанд үүсгэж, үйл ажиллагааг илүү тав тухтай болгодог;
	3.	Олон төрлийн алдааг боловсруулах, нарийвчилсан алдааны мэдээллийн бүртгэл;
	4.	Нарийвчилсан бодит цагийн цагийг суулгасан, ухаалаг барилгын менежментийг хэрэгжүүлэхэд тохиромжтой цагийн хуваарийн хяналтын олон төрлийн функцүүдийг хангадаг;
	5.	Энгийн параметрийн дизайнтай тул лифтний нээлт, засвар үйлчилгээ хийхэд хялбар, энгийн.
                `}
            />

            <CustomSection
                src="/r2.jpg"
                title="Байнгын соронзон синхрон хаалганы машин"
                paragraph={`
	1.	Өндөр дасан зохицох чадвар: өргөн хүчдэлийн хамтлагийн орох загвартай, оролтын хүчдэл 220v±20%;
	2.	Найдвартай ажиллагаа: Машин нь хүнд хэцүү хэвийн бус төлөвийн туршилтыг давж, 3 сая удаа ажиллуулах функциональ туршилт болон найдвартай байдлын шалгалтыг давсан;
	3.	Хаалгагүй талбайн идэвхтэй аюулгүй байдлын хамгаалалт нь хаалгыг хүчээр унах ослоос сэргийлнэ;
	4.	UCMP машины санаандгүй хөдөлгөөний хамгаалалт нь машиныг санамсаргүй хөдөлгөөнөөс хамгаална;
	5.	Лифтний хаалганы мөргөлдөөний эсрэг хамгаалалтын төхөөрөмж.
                `}
            />

            <CustomSection
                src="/r3.jpg"
                title="Машины абсолют байрлалын хяналтын технологи"
                paragraph={`
	•	Систем нь машины байрлалыг нарийвчлан хянадаг;
	•	Гүйцэтгэлийн байрлалыг нарийвчлан тооцоолно;
	•	Зорчигчдыг үргэлж хамгаалалттай байлгана.                `}
            />

            <CustomSection
                src="/r4.jpg"
                title="Олон талт аюулгүй байдлын хамгаалалт"
                paragraph={`
	•	Лифтний аюулгүй хэрэглээг хангаж, хүний ​​аюулгүй байдалд аюул учруулах аливаа ослоос урьдчилан сэргийлэх;
	•	Хэт хурдны зохицуулагч · Аюулгүйн хавчаар · Буфер · Хэт хурдны хамгаалалт · Фазын алдаа хамгаалах · Дээд ба доод хязгаарлалт.
                `}
            />

            <CustomSection
                src="/r5.jpg"
                title="FUJI-Cloud платформ"
                paragraph={`
	•	Таны аюулгүй байдалд анхаарч, лифтний үйл ажиллагааны төлөв болон засвар үйлчилгээний явцыг бүхэлд нь хянах;
	•	Бодит цаг хугацааны асуудлыг илрүүлэх · Түргэн шийдвэрлэх · Тохиромжтой, үр ашигтай засвар үйлчилгээг хангах;
	•	Менежментийн үр ашгийг ихээхэн дээшлүүлж, борлуулалтын дараах чанарыг сайжруулж, таны аюулгүй байдлыг хангах.                `}
            />
        </>
    );
}
