import { Block } from "@/components/ui/block";
import { ContactUs } from "@/components/ui/contact-us";
import { COP_LOP_LANDING_DOOR_CEILING } from "@/components/ui/COP_LOP_LANDING_DOOR_CEILING";
import { ImageBlock } from "@/components/ui/imageBlock";
import { LEFT_IMG_RIGHT_TXT } from "@/components/ui/LEFT_IMG_RIGHT_TXT";
import { MoreDecorations } from "@/components/ui/more-decorations";
import { RIGHT_IMG_LEFT_TXT } from "@/components/ui/RIGHT_IMG_LEFT_TXT";
import { H1 } from "@/components/ui/text";
import H from "@/public/h1.jpg";

export default function Page() {
    return (
        <>
            <Block
                title="Эмнэлгийн цахилгаан шат"
                body="Фүжи Присижн-ийн эмнэлгийн цахилгаан шат нь эмнэлэг болон эрүүл мэндийн байгууллагуудад зориулан тусгайлан зохион бүтээгдсэн бөгөөд өвчтөн, эмнэлгийн ажилтан, тоног төхөөрөмжийн аюулгүй, тав тухтай тээврийг хангах онцгой шинж чанар, боломжуудтай. Эмнэлгийн цахилгаан шатны найдвартай, аюулгүй ажиллагааг хангах үүднээс Фүжи Присижн-ийн цахилгаан шат нь ариутгалтай кабин, оролттой хамгаалалт, цэвэр агаарын агааржуулалтын систем, давтагдашгүй чичиргээ дарах технологиор тоноглогдсон.

Товчхондоо, Фүжи Присижн цахилгаан шатны эмнэлгийн цахилгаан шат нь эмнэлгийн үйл ажиллагаа, өвчтөн, ажилтнуудын тасралтгүй, найдвартай тээвэрлэлтэд аюулгүй, найдвартай, тав тухтай үйлчилгээ үзүүлэх болно. Одоо чатлаарай!"
                imageAlt="Hospital elevator 1"
                image={H}
                imageBlur="/h1-b.jpg"
                bodyChildren={<ContactUs />}
            ></Block>
            <section>
                <h1 className="text-2xl md:text-3xl text-center">
                    Бүрэн тоноглогдсон Фүжи Присижн эмнэлгийн цахилгаан шат нь эмч, өвчтөнд тохиромжтой үйлчилгээг үзүүлнэ.
                </h1>
                <div className="grid grid-cols-2 md:grid-cols-3 gap-4 md:gap-8 my-4 md:my-8">
                    {[
                        "Өндөр чанартай, олон үйлдэлт орны цахилгаан шат",
                        "Хүний хэрэгцээнд нийцсэн загвартай эмнэлгийн цахилгаан шат",
                        "Аюулгүй, тохиромжтой орны цахилгаан шат",
                        "Гурван талын бариултай орны цахилгаан шат",
                        "Фүжи аюулгүй орны цахилгаан шат",
                        "Аюулгүй эмнэлгийн цахилгаан шат",
                    ].map((desc, idx) => {
                        return <ImageBlock description={desc} src={`/hj${idx + 1}.jpg`} alt={desc} key={`preview-hospital-elevator-${idx}`} />;
                    })}
                </div>
            </section>
            <MoreDecorations />
            <COP_LOP_LANDING_DOOR_CEILING />
            <section className="flex flex-col gap-6 pb-24">
                <LEFT_IMG_RIGHT_TXT title="EMC Үйлдэл" imgAlt="Hospital Type 1" imgSrc="/hp1.jpg">
                    <p>
                        EMC нь хоёр талтай: EMI (цахилгаан соронзон хөндлөнгийн нөлөө) болон EMS (цахилгаан соронзон тэсвэрлэх чадвар). Нэг талаас,
                        цахилгаан шатнаас үүсэх цахилгаан соронзон цацраг маш бага тул нарийн эмнэлгийн тоног төхөөрөмж болон өвчтөнд ямар ч
                        хөндлөнгийн нөлөө үзүүлэхгүй. Нөгөө талаас, цахилгаан шат нь цахилгаан соронзон цацрагийн хөндлөнгийн нөлөөнд тэсвэртэй бөгөөд
                        энэ нь ямар ч эмнэлгийн тоног төхөөрөмжийн цахилгаан соронзон хөндлөнгийн орчинд цахилгаан шат тогтвортой, хэвийн ажиллах
                        боломжийг хангана.
                    </p>
                </LEFT_IMG_RIGHT_TXT>
                <RIGHT_IMG_LEFT_TXT title="Яаралтай тусламжийн суваг дизайн" imgAlt="Hospital Type 2" imgSrc="/hp2.jpg">
                    <p>
                        {`Яаралтай тусламжийн товчийг онцгой байдлын үед идэвхжүүлэхэд, цахилгаан шат "яаралтай тусламжийн суваг" үйлдлийг даруй эхлүүлж, бусад дуудлагын хүсэлтийг хүлээн авахгүй. Энэ нь дээш, доош шууд зорчих тусгай суваг үүсгэж, харьцангуй бие даасан ажиллагааны систем болдог. Зорчигч кабинд орсны дараа цахилгаан шат "зорьсон давхар руу" шууд явж, аврах ажлыг саадгүй гүйцэтгэнэ.`}
                    </p>
                </RIGHT_IMG_LEFT_TXT>

                <LEFT_IMG_RIGHT_TXT title="Ариутгалтай кабин ашиглалтыг тэргүүлж байна" imgAlt="Hospital Type 3" imgSrc="/hp3.jpg">
                    <ol className="list-decimal pl-4">
                        <li>Давхарласан анти-бактери технологи, халдвар дамжихаас сэргийлнэ</li>
                        <li>Байгалийн хүчилтөрөгчийн бар, нэмэлт сөрөг ионы төхөөрөмж</li>
                        <li>Хэт ягаан туяаны ариутгалын төхөөрөмж, халдварын эрсдлийг бууруулна</li>
                        <li>Кабины анти-бактери боловсруулалт, орчныг хамгаална</li>
                    </ol>
                </LEFT_IMG_RIGHT_TXT>
            </section>
        </>
    );
}
