import { P, Section } from "@/components/ui/text";

export default function Page() {
    return (
        <>
            <Section>
                <P>
                    FUJI Precision компани нь зураг төсөл боловсруулах, үйлдвэрлэх, суурилуулах, засвар үйлчилгээ, борлуулалтын дараах үйлчилгээ зэрэг
                    мэргэжлийн үйлчилгээг үзүүлдэг. Шаардлагатай тохиолдолд дараах хэлтсүүдтэй холбогдоно уу. Бид цаг тухайд нь хариу өгч, танд түргэн
                    шуурхай, шилдэг үйлчилгээг үзүүлэхээ амлаж байна.
                </P>
            </Section>
        </>
    );
}
