import { Block } from "@/components/ui/block";
import { ContactUs } from "@/components/ui/contact-us";
import { COP_LOP_LANDING_DOOR_CEILING } from "@/components/ui/COP_LOP_LANDING_DOOR_CEILING";
import { ImageBlock } from "@/components/ui/imageBlock";
import { LEFT_IMG_RIGHT_TXT } from "@/components/ui/LEFT_IMG_RIGHT_TXT";
import { MoreDecorations } from "@/components/ui/more-decorations";
import { RIGHT_IMG_LEFT_TXT } from "@/components/ui/RIGHT_IMG_LEFT_TXT";
import { H1 } from "@/components/ui/text";
import PAN from "@/public/pan1.jpg";

export default function Page() {
    return (
        <>
            <Block
                title="Панорам цахилгаан шат"
                body="Фүжи Присижн-ийн панорам цахилгаан шат нь зорчигчдод үзэсгэлэнт газрууд, хотын байгаль, бусад сонирхолтой дүр зургийг харах боломжийг олгодог. Эдгээр цахилгаан шат нь ирээдүйн хэв маягтай өвөрмөц загвартай бөгөөд гэрэл, хөгжим, дүрслэлийг төгс хослуулан гайхамшигтай өндөрлөгийн гоо сайхныг танд харуулдаг.

Фүжи панорам цахилгаан шат нь кабинны хэлбэрийн хувьд дөрвөлжин, хагас дугуй, бүтэн дугуй, алмаазан гэх мэт чөлөөт сонголттой бөгөөд өндөр барилга, дурсгалт газрууд болон бусад газруудад суурилуулснаар зочдод дахин давтагдашгүй аяллын туршлагыг олгодог. Одоо чатлаарай!"
                imageAlt="Panoramic elevator 1"
                image={PAN}
                imageBlur="/pan1-b.jpg"
                bodyChildren={<ContactUs />}
            ></Block>

            <section>
                <h1 className="text-2xl md:text-3xl">FUJI Precision: Таны сонголтын тансаг зэрэглэлийн болон захиалгат цахилгаан шат!</h1>
                <div className="grid grid-cols-2 md:grid-cols-5 gap-4 md:gap-8 my-4 md:my-8">
                    {[
                        "Гайхамшигтай үзэсгэлэнтэй хагас дугуй ажиглалтын цахилгаан шат",
                        "Тансаг, аюулгүй хагас дугуй ажиглалтын цахилгаан шат",
                        "Ти-алт хүрээтэй үзэсгэлэнт цахилгаан шат",
                        "Гоёлын хүрээтэй, тусгай загвар бүхий гурван талын үзэмжийн цахилгаан шат",
                        "Ти-алт хүрээтэй, дөрвөн талын үзэмжийн цахилгаан шат",
                        "Фүжи Присижн үзэсгэлэнтэй ажиглалтын цахилгаан шат",
                        "Фүжи сайн загвартай дөрвөлжин ажиглалтын цахилгаан шат",
                        "Өндөр чанартай, аюулгүй хагас дугуй ажиглалтын цахилгаан шат",
                        "Халуун хямдралтай, аюулгүй хагас дугуй ажиглалтын цахилгаан шат",
                        "Фүжи Присижн үр ашигтай ажиглалтын цахилгаан шат",
                    ].map((desc, idx) => {
                        return (
                            <ImageBlock
                                description={desc}
                                src={`/p${idx + 1}.jpg`}
                                alt={`FUJI precision beautiful observation elevator ${idx + 1}`}
                                key={`preview-home-elevator-${idx}`}
                            />
                        );
                    })}
                </div>
            </section>
            <MoreDecorations />
            <COP_LOP_LANDING_DOOR_CEILING />
            <section className="flex flex-col gap-6 pb-24">
                <div className="my-8">
                    <H1 className="text-center">Цаг уурын нөхцөл ба гадна ажиглалтын цахилгаан шат</H1>
                </div>
                <LEFT_IMG_RIGHT_TXT title="Мөсжилт ба хүйтэн цаг агаар" imgAlt="Icing and frosty weather" imgSrc="/pb1.jpg">
                    <p>
                        Мөсжилт, хяруу нь ерөнхий зориулалтын ачаалал бүхий гадна ажиглалтын цахилгаан шатны үйл ажиллагаанд ноцтой аюул учруулдаг.
                        Салбарын зөвлөмжөөр мөс, хяруу тогтмол үүсдэг газруудад гадна талын үзэсгэлэнт цахилгаан шат суурилуулах нь тохиромжгүй гэж
                        үздэг. Харин мөс, хяруу хааяа тохиолддог газруудад ийм цахилгаан шатыг мөс, хяруу үүссэн үед ажиллуулахгүй байх нь зүйтэй.
                        Салхитай цаг агаар нь гадна талын үзэсгэлэнт цахилгаан шатны ажиллагааг сааруулж, хурдыг багасгах эсвэл бүр зогсоох хоёр дахь
                        шалтгаан болдог. Хүчтэй салхи ихэвчлэн байдаг газруудад гадна цахилгаан шатыг суурилуулах нь зохимжгүй, хэрэв цахилгаан шатны
                        босоо ам салхинаас бүрэн хамгаалагдсан байршилд байхгүй бол. Иймээс цахилгаан шатыг гадна талаас ажиллуулахад цаг агаарын
                        таагүй нөхцөл байдал үүсэх үед дотор цахилгаан шат тасралтгүй босоо тээврийг хангах боломжтой байх нь чухал.
                    </p>
                </LEFT_IMG_RIGHT_TXT>
                <RIGHT_IMG_LEFT_TXT title="Нэмэлт улирлын цаг агаар" imgAlt="Additional seasonal weather" imgSrc="/pb2.jpg">
                    <p>
                        Бага зэргийн бороо, халуун цаг агаар сайн төлөвлөж, зөв суурилуулсан гадна цахилгаан шатанд хор хөнөөлгүй боловч улирлын
                        чанартай тоос шороо, элс нь тоног төхөөрөмжид элэгдэл үүсгэж, засвар үйлчилгээний зардлыг нэмэгдүүлж болзошгүй. Энэ нь
                        барилгад гадна цахилгаан шат суурилуулах шийдвэр гаргахаас өмнө анхаарах асуудлуудын нэг юм. Гадна орчинд ил задгай байх
                        цахилгаан шатны бүх эд ангиудыг зөв боловсруулж, хамгаалалтаар хангах ёстой.
                    </p>
                </RIGHT_IMG_LEFT_TXT>

                <div className="my-8">
                    <H1 className="text-center">Үзэмжийн цахилгаан шатны техникийн шинж чанарууд</H1>
                </div>

                <LEFT_IMG_RIGHT_TXT title="Кабин" imgAlt="Car" imgSrc="/pb3.jpg">
                    <p>
                        Ажиглалтын цахилгаан шатны шинэлэг тал нь кабинд тунгалаг үзэгдэх хөшигний хананы ашиглалт юм. Ажиглалтын цахилгаан шатны
                        загвар, үйлдвэрлэл, угсралтын ажилд оролцож буй бүх ажилтнууд шилний угсралтын салбарт мэргэшсэн байх ёстой. Дизайнерууд
                        үзэсгэлэнт цахилгаан шатны кабиныг зохион бүтээхээс өмнө холбогдох барилгын норм, дүрмүүдтэй зөвлөлдөж, шилэн материал ашиглах
                        шаардлагуудыг ойлгох хэрэгтэй. Тунгалаг ханыг ачаалал даах, бүтцийн элемент болгон ашиглах ёсгүй. Үзэгдэх ханы хүрээ нь хэв
                        гажилт үүсгэхгүйгээр зорчигчдын үүсгэж болох хэвтээ хүчийг даах чадвартай байх ёстой. Дээвэр болон ёроолын таг нь бат бөх,
                        хөнгөн жинтэй, амархан солих боломжтой байх хэрэгтэй. Мөн гаднах гоёлын гадаргуу засвар, тослох материалын нөлөөнд өртөхгүй
                        байх ёстой.
                    </p>
                </LEFT_IMG_RIGHT_TXT>
                <RIGHT_IMG_LEFT_TXT title="Ил эд анги, бүрэлдэхүүн хэсгүүд" imgAlt="Exposed parts and components" imgSrc="/pb4.jpg">
                    <p>
                        Цахилгаан шатны хаалганы ил гадаргуу, дагалдах хэрэгсэл болон кабины гаднах бүх харагдах хэсгүүдийг гөлгөр, бат бөх,
                        зэврэлтэнд тэсвэртэй, цэвэрлэхэд хялбар материалаар хийсэн байх шаардлагатай. Эдгээр материалын гадаргууг зэврэлтээс
                        хамгаалагдсан ган эсвэл паалангаар бүрдэг. Засварын ажилтнууд цахилгаан шатны дээвэр дээр тоног төхөөрөмжийн засвар, үзлэг
                        хийх аюулгүй орчинтой байх ёстой. Үүнд хонгилын хаалга, хүрээний дагалдах хэрэгсэл зэрэг ил хэсгүүдийг цэвэрлэх ажлыг
                        багтаана. Ажиглалтын цахилгаан шатны кабин нь ихэвчлэн дээврийн яаралтай гарцгүй байдаг. Ёроолын хэсэг нь цахилгаан шатны
                        хамгийн доод түвшинд байрладаг бөгөөд засварын ажилчид тэндээс аюулгүйгээр хандаж, гадаа гэрэлтүүлэг солих зэрэг засвар,
                        цэвэрлэгээ хийх боломжтой байх ёстой. Хамгийн чухал нь босоо амны (ёроолын) хашлага нь зорчигчид болон явган зорчигчид түүнд
                        санамсаргүйгээр орохоос сэргийлэх ёстой. Босоо амны доод хэсэгт цахилгаан шатны тоног төхөөрөмжийн гоёл чимэглэлтэй уялдсан
                        тунгалаг хөшигний хана тавьж, энэ нь цахилгаан шатны иргэний барилгын ажлын нэг хэсэг болдог.
                    </p>
                </RIGHT_IMG_LEFT_TXT>
            </section>
        </>
    );
}
